app/views/books/index.html.erb

  <%= label_tag :filter_by_author%>
  <%= select_tag :author, options_for_select(Book.pluck(:author).uniq), include_blank: true %>
---
SELECT "books"."author" FROM "books"