app/controllers/admin_sessions_controller.rb

  def create
    admin = Admin.find_by_username(params[:username])
---
SELECT "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]