app/controllers/application_controller.rb

  def admin_user
    if session[:admin_id]
      @admin_user ||= Admin.find(session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def current_order
    if !session[:order_id].nil?
      Order.find(session[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]