app/controllers/books_controller.rb

  def index
    @books = if params[:author].present?
               Book.by_author(params[:author])
             elsif params[:rating].present?
               Book.where('average_rating >= ?', params[:rating].to_f)
             else
               Book.all
---
SELECT "books".* FROM "books" WHERE (:average_rating >= 2.0)
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "author", "publisher", "price", "stock", "created_at", "updated_at", "average_rating") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = ?, "average_rating" = ? WHERE "books"."id" = ?  [["updated_at", "2023-02-15 16:42:06.201720"], ["average_rating", 0.0], ["id", 4]]