app/controllers/order_items_controller.rb

  def index
    # @order_items = OrderItem.all
    @order_items = OrderItem.all.where(user_id:current_user.id)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]

  def create
    @order = current_order
    if session[:order_id].nil?
      @order.user_id = current_user.id
      @order.save
      session[:order_id] = @order.id
    end

    @order_item = @order.order_items.new(order_params)

    @order_item.user_id = current_user.id
    respond_to do |format|

      if @order_item.save
---
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2023-02-21 23:53:31.351426"], ["updated_at", "2023-02-21 23:53:31.351426"], ["user_id", 9]]
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2023-02-20 22:06:16.081559"], ["updated_at", "2023-02-20 22:06:16.081559"], ["user_id", 1]]
INSERT INTO "order_items" ("order_id", "book_id", "quantity", "total", "unit_price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["order_id", 2], ["book_id", 4], ["quantity", 1], ["total", 40.0], ["unit_price", 40.0], ["user_id", 9], ["created_at", "2023-02-22 00:13:44.039560"], ["updated_at", "2023-02-22 00:13:44.039560"]]

  def destroy
    @order_item.destroy
---
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 16]]

  def checkout

    if current_user.cc_num != nil and current_user.phone_num != nil
      @order_items = OrderItem.all.where(user_id:current_user.id)
      @total_amount = 0
      @order_items.each do |item|
        @book = Book.find_by(id: item.book_id)
          if @book.stock < item.quantity
            redirect_to order_items_url, notice: "The stock for book with id: #{@book.id} is not sufficient"
          else
            @book.stock = @book.stock - item.quantity
            @book.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ?  [["user_id", 9]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["stock", 17], ["updated_at", "2023-02-22 00:31:19.108219"], ["id", 2]]

  def place_order
    @transactions = Array.new
    @transaction_label = Array.new(10){[*"A".."Z", *"0".."9"].sample}.join
    @user = current_user
    @order_items = OrderItem.all.where(user_id:current_user.id)
    @order_items.each do |item|
      @book = Book.find_by(id: item.book_id)
        @transaction = Transaction.new
        @transaction.transaction_number = @transaction_label
        @transaction.user_id = current_user.id
        @transaction.phone_number = @user.phone_num
        @transaction.address = @user.address
        @transaction.book_id = @book.id
        @transaction.credit_card_number = @user.cc_num
        @transaction.quantity = item.quantity
        @transaction.total_price = @book.price * item.quantity

        if @transaction.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ?  [["user_id", 9]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."user_id" = ?  [["user_id", 10]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "transactions" ("transaction_number", "credit_card_number", "address", "phone_number", "quantity", "total_price", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]