app/controllers/reviews_controller.rb

  def index
    @reviews = if params[:book_id].present?
                  Review.where(book_id: params[:book_id])
               elsif params[:book].present?
                  Review.joins(:book).where(books: {name: params[:book]})
               elsif params[:user].present?
                  Review.joins(:user).where(users: {username: params[:user]})
               elsif params[:user_id].present?
                  Review.where(user_id: current_user.id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" != ?  [["user_id", 4]]