app/controllers/reviews_controller.rb

  def index
    @reviews = if params[:book_id].present?
                  Review.where(book_id: params[:book_id])
               elsif params[:book].present?
                  Review.joins(:book).where(books: {name: params[:book]})
               elsif params[:user].present?
                  Review.joins(:user).where(users: {username: params[:user]})
               else
                 Review.all
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" INNER JOIN "books" ON "books"."id" = "reviews"."book_id" WHERE "reviews"."book_id" = ? LIMIT ?  [["book_id", nil], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" INNER JOIN "users" ON "users"."id" = "reviews"."user_id" WHERE "reviews"."user_id" = ? LIMIT ?  [["user_id", nil], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"

  def create
    @review = Review.new(review_params)
    @book = Book.find(params[:review]["book_id"])
    @review.user_id = current_user.id
    @review.book_id = @book.id
    respond_to do |format|
      if @review.save
        @book.average_rating = @book.average_rating + @review.rating
        @book.average_rating = @book.average_rating / Review.where(book_id: @book.id).count
        @book.average_rating = @book.average_rating.round(2)
        @book.save!
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "review", "created_at", "updated_at", "book_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 2], ["review", "Okayish"], ["created_at", "2023-02-15 19:06:21.077515"], ["updated_at", "2023-02-15 19:06:21.077515"], ["book_id", 4], ["user_id", 2]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 4]]
UPDATE "reviews" SET "review" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["review", "gffft"], ["updated_at", "2023-02-15 15:51:52.070795"], ["id", 1]]
UPDATE "books" SET "updated_at" = ?, "average_rating" = ? WHERE "books"."id" = ?  [["updated_at", "2023-02-15 19:06:21.081669"], ["average_rating", 2.0], ["id", 4]]

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "review" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["review", "gffft"], ["updated_at", "2023-02-15 15:51:52.070795"], ["id", 1]]