app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", 3]]
SELECT "transactions".* FROM "transactions"
---
  def index
    if current_user.id != nil
      @transactions = Transaction.where(user_id: current_user.id)
    else
      @transactions = Transaction.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @transaction = Transaction.new
    if @book.nil?
      @book = Book.find(params[:book_id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "transactions" ("transaction_number", "credit_card_number", "address", "phone_number", "quantity", "total_price", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "books" SET "stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["stock", 2], ["updated_at", "2023-02-14 22:48:42.197094"], ["id", 2]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.transaction_number = Array.new(10){[*"A".."Z", *"0".."9"].sample}.join
    @book = Book.find(params[:transaction]["book_id"])
    @transaction.user_id = current_user.id
    @transaction.book_id = @book.id

    respond_to do |format|
      if @transaction.save
        @book.stock = @book.stock - @transaction.quantity
        @book.save!