app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params).lock!("FOR UPDATE NOWAIT")
    @transaction.transaction_number = Array.new(10){[*"A".."Z", *"0".."9"].sample}.join
    @book = Book.find(params[:transaction]["book_id"])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]