app/controllers/users_controller.rb

  def show
    if current_user
      @user = current_user
    elsif admin_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password_digest", "name", "email", "address", "cc_num", "phone_num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)