app/views/reviews/index.html.erb

      <%= label_tag :filter_by_book%>
      <%= select_tag :book, options_for_select(Book.pluck(:name).uniq), include_blank: true %>
---
SELECT "books"."name" FROM "books"

      <%= label_tag :filter_by_user%>
      <%= select_tag :user, options_for_select(User.pluck(:username).uniq), include_blank: true %>
---
SELECT "users"."username" FROM "users"